test-load.yaml
config:
  target: 'http://localhost:5231'
  phases:
    - duration: 5  # Durée du test en secondes
      arrivalRate: 10  # Requêtes par seconde
  payload:
      # Define the coping file and fields to load
      path: "test-data/token.csv"
      fields:
        - "token"
      # Specify sequential if you want to run csv in order from the beginning 
      order: sequence
      # Ignore the first line of the csv
      skipHeader: true

scenarios:
  - flow:
      - get:
          url: "/api/v1/auth/verify-token"
          qs:
            token: "{{token}}"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "jessica@gmail.com"
            password: "Jessica08"
      - post:
          url: "/api/v1/rents/predict"
          headers:
            authorization: "Bearer {{token}}"
          json:
            price: 500.0
            longitude: 0.0
            latitude: 0.0
            region: "Montreal"
            state: "QC"
            squareFeet: 5
            baths: 5
            beds: 5
# make sure a dotnet server is running
# artillery run test-load.yaml