test-load.yaml
config:
  target: 'http://localhost:5231'
  phases:
    - duration: 5  # Durée du test en secondes
      arrivalRate: 10  # Requêtes par seconde
  defaults:
    headers:
      authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6Implc3NpY2FAZ21haWwuY29tIiwicm9sZSI6IlVzZXIiLCJuYmYiOjE3MzQ0NTUxNDUsImV4cCI6MTczNDQ1ODc0NSwiaWF0IjoxNzM0NDU1MTQ1fQ._drcb5eC72jxEfPrUP6w-oMLmNEwpcE1c22XzDMzOsA"

scenarios:
  - flow:
      - get:
          url: "/api/v1/auth/verify-token"
          qs:
            token: "notatoken"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "jessica@gmail.com"
            password: "Jessica08"
      - post:
          url: "/api/v1/rents/predict"
          json:
            price: 500.0
            longitude: 0.0
            latitude: 0.0
            region: "Montreal"
            state: "QC"
            squareFeet: 5
            baths: 5
            beds: 5
# make sure a dotnet server is running
# artillery run test-load.yaml